Тестовая_база_ERP_14/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаУУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаФО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Тестовая_база_ERP_14/src/InformationRegisters/ЗаданияКЗакрытиюМесяца/ЗаданияКЗакрытиюМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияКЗакрытиюМесяца</name>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииЗакрытияМесяца</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/ОперацииЗакрытияМесяца/ОперацииЗакрытияМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииЗакрытияМесяца</name>
  <enumValues>
    <name>АннулированиеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчетовУчетаДоходовИРасходовМУ</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеДублейВидовЗапасов</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОтрицательныхОстатковТоваровОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибокВИсходныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеРазвернутыхОстатковПоВзаиморасчетам</name>
  </enumValues>
  <enumValues>
    <name>НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции</name>
  </enumValues>
  <enumValues>
    <name>НастройкаРаспределенияРасходов</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииНМА</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииОС</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииОСиНМАМеждународныйУчет</name>
  </enumValues>
  <enumValues>
    <name>НачислениеОценочныхОбязательствРезервовПоОтпускам</name>
  </enumValues>
  <enumValues>
    <name>НачислениеСписаниеРезервовПредстоящихРасходов</name>
  </enumValues>
  <enumValues>
    <name>НачисленияПоКредитамДепозитамИВыданнымЗаймам</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеДокументовВМеждународномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеДокументовВРегламентированномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеЗарплатыВФинансовомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеВыкупаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеВыработкиСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОстатковТоваровКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовКомитентамОСписании</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовПоКомиссииМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПередачМатериаловВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПередачТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПроизводстваБезЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСчетовФактурИТаможенныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаДенежныхСредствИФинансовыхИнструментов</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаНовыеРежимыУчета</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаУчетВнеоборотныхАктивовВерсии24</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНДСВБюджетПоОтдельнымОперациям</name>
  </enumValues>
  <enumValues>
    <name>ПланированиеПроизводстваПродукцииБезСпецификаций</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСтоимостиТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВНалоговомУчетеЛизинговыхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовПриУСН</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеДоходовИРасходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции21</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции22</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеНДС</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовБудущихПериодов</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗемельногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазниц</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВВалютеПредставления</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВФункциональнойВалюте</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаУСН</name>
  </enumValues>
  <enumValues>
    <name>РасчетПартийИСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>РасчетСтоимостиВнеоборотныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>РасчетТорговогоСбора</name>
  </enumValues>
  <enumValues>
    <name>РасчетТранспортногоНалога</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗатратНаВыпускБезРаспоряжений</name>
  </enumValues>
  <enumValues>
    <name>СторноДоходовКУДиР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАмортизацияОС</name>
    <comment>Использовалось до версии 2.4</comment>
  </enumValues>
  <enumValues>
    <name>УстановкаДатыЗапретаФормированияПроводокМУ</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоВнеоборотнымАктивам</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеЗаписейКнигПокупокИПродаж</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеРезервовПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеФинансовогоРезультата</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/AccountingRegisters/Хозрасчетный/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, РежимЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Если ДополнительныеСвойства.Свойство("НеВыполнятьДопОбработкуПроводок")
		И ДополнительныеСвойства.НеВыполнятьДопОбработкуПроводок Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыБухгалтерии.Хозрасчетный.ВыполнитьДопОбработкуПроводок(ЭтотОбъект);
	
	ПроверкаИзмененияРегистра = Ложь;
	Если ДополнительныеСвойства.Свойство("ПроверкаИзмененияРегистра", ПроверкаИзмененияРегистра) И ПроверкаИзмененияРегистра = Истина Тогда
		// Проверим изменения в в наборе записей проводов и если изменения есть - зарегистрируем операции к формированию финансового результата.
		
		// Текущее состояние набора помещается во временную таблицу,
		// чтобы при записи получить изменение нового набора относительно текущего.
		
		ТекстыЗапросовДляПолученияТаблицыИзменений = 
			ЗакрытиеМесяцаСервер.ТекстыЗапросовДляПолученияТаблицыИзмененийРегистра(ЭтотОбъект.Метаданные(), ЭтотОбъект.Отбор);
			
		СтруктураПроверкиИзмененияРегистра = Новый Структура();
		СтруктураПроверкиИзмененияРегистра.Вставить("ТекстВыборкиТаблицыИзменений", ТекстыЗапросовДляПолученияТаблицыИзменений.ТекстВыборкиТаблицыИзменений);
		СтруктураПроверкиИзмененияРегистра.Вставить("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц);
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураПроверкиИзмененияРегистра.МенеджерВременныхТаблиц;
		Запрос.Текст = ТекстыЗапросовДляПолученияТаблицыИзменений.ТекстВыборкиНачальныхДанных;
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		
		Запрос.Выполнить();
		
		ДополнительныеСвойства.Вставить("СтруктураПроверкиИзмененияРегистра", СтруктураПроверкиИзмененияРегистра);

	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, РежимЗаписи)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПроверкиИзмененияРегистра = Неопределено;
	Если Не Отказ И ДополнительныеСвойства.Свойство("СтруктураПроверкиИзмененияРегистра", СтруктураПроверкиИзмененияРегистра) Тогда
		
		ИмяРегистра = "Хозрасчетный";
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураПроверкиИзмененияРегистра.МенеджерВременныхТаблиц;
		
		Если НЕ ПланыОбмена.ГлавныйУзел() = Неопределено Тогда // В РИБ данный регистр обрабатывается только в главном узле.
			
			// Уничтожаем таблицу начальных записей регистра:
			Запрос.Текст = "УНИЧТОЖИТЬ НачальныеЗаписи" + ИмяРегистра;
			Запрос.Выполнить();
			Возврат;
			
		КонецЕсли;
		
		// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
		// и если отличия найдены регистрация задание на формирование финансового результата.	
		Запрос.Текст = СтруктураПроверкиИзмененияРегистра.ТекстВыборкиТаблицыИзменений;
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		
		ТекстАктуализацииЗакрытияМесяца =
		"ВЫБРАТЬ
		|	ТаблицаИзменений.Организация КАК Организация,
		|	ТаблицаИзменений.Регистратор КАК Документ,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ФормированиеФинансовогоРезультата) КАК Операция,
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(ТаблицаИзменений.Период, Месяц)) КАК Месяц
		|ИЗ
		|	ТаблицаИзмененийХозрасчетный КАК ТаблицаИзменений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаИзменений.Организация,
		|	ТаблицаИзменений.Регистратор";
				
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + ТекстАктуализацииЗакрытияМесяца;
			
		// Уничтожаем таблицу изменений регистра:
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + "УНИЧТОЖИТЬ ТаблицаИзмененийХозрасчетный";
		
		Выборка = Запрос.Выполнить().Выбрать();
		РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписиРегистраПоДаннымВыборки(Выборка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
